Catalogs/ТрудовыеФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ТрудовыеФункции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПрофессиональнойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТрудовыеФункции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ОКЗКод")
			И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ОКЗКод) Тогда
			
			Объект.КодПоОКЗ = Справочники.КлассификаторЗанятий.НайтиПоКоду(Параметры.ЗначенияЗаполнения.ОКЗКод);
		КонецЕсли;
		
		УстановитьОтображениеЭлементов(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОтображениеЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтображениеЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы
		И ОписаниеОповещенияОЗакрытии <> Неопределено
		И Не Модифицированность
		И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОКПДТРКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПослеДобавленияКодовИзКлассификатора", ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОКПДТРКод", Объект.ОКПДТРКод + Объект.ОКПДТРКЧ);
	
	ОткрытьФорму("Справочник.ТрудовыеФункции.Форма.ВыборОКПДТР", СтруктураПараметров, ЭтотОбъект, , , , Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОКПДТРКодОчистка(Элемент, СтандартнаяОбработка)
	Объект.ОКПДТРКЧ = "";
	Объект.ОКПДТРКатегория = "";
	Объект.КодПоОКЗ = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	
	УстановитьОтображениеЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеДобавленияКодовИзКлассификатора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ОКПДТРКод		 = Результат.ОКПДТРКод;
		Объект.ОКПДТРКЧ			 = Результат.ОКПДТРКЧ;
		Объект.ОКПДТРКатегория	 = Результат.ОКПДТРКатегория;
		
		Если ЗначениеЗаполнено(Результат.ОКЗКод) Тогда
			Объект.КодПоОКЗ = ЗначениеОКЗПоКоду(Результат.ОКЗКод);
		Иначе
			Объект.КодПоОКЗ = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеОКЗПоКоду(КодОКЗ)
	
	Возврат Справочники.КлассификаторЗанятий.НайтиПоКоду(КодОКЗ);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЭлементов(УправляемаяФорма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"ПредупрежедниеОДлинеОписания",
		"Видимость",
		СтрДлина(УправляемаяФорма.Объект.Описание) > 255);
	
	Если Не ПустаяСтрока(УправляемаяФорма.Объект.ИмяПредопределенныхДанных) Тогда
		
		УправляемаяФорма.ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"ГруппаОКПДТР",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"Описание",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"КодПрофессиональнойДеятельности",
			"Маска",
			"NNNNNNNNNN");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
